{
    "salutation": {
        "hello": "Hello World"
    },
    "routes": {
        "goToHome": "Go to home"
    },
    "aboutMe": {
        "title": "About Me",
        "text": "My name is Mélanie Rodrigues, and I'm a creative developer based in Lisbon, Portugal. With my 3 years of experience as a product designer and project manager, I bring a unique perspective to my current work as a developer. I'm passionate about all things tech and design, and I love nothing more than creating beautiful and functional websites and applications. In my free time, I enjoy exploring the world of game development, riding my motorcycle, camping, and indulging in my love of illustration. My approach to work is all about collaboration, creativity, and clean code! I believe that a positive and solution-driven attitude is essential to success. If you're interested in working together on a project, please don't hesitate to get in touch. I'm always up for a new challenge and would love to hear about your ideas.",
        "skills": {
            "programming": "Programming",
            "tools": "Tools",
            "design": "Design",
            "methodologies": "Methodologies",
            "languages": "Languages",
            "programmingTextRight": "HTML \n CSS3 \n JavaScript (ES6) \n C# \n TypeScript \n React.js \n Vue.js \n Unity",
            "toolsTextRight": "VSC \n Redmine \n Git/GitHub \n Trello",
            "designTextRight": "Figma \n Zeplin \n Adobe Photoshop \n Adobe Illustrator \n Adobe Indesign ",
            "methodologiesTextRight": "Scrum \n Design Thinking",
            "languagesTextRight": "Portuguese \n French \n English"
        }
    },
    "activities": {
        "title": "Activities"
    },
    "littleApresentation": {
        "title": "Mélanie",
        "subtitle": "creative developer",
        "paragraph": "I’m a software engineer specializing in building exceptional digital experiences. \n Currently, I’m focused on building accessible, human-centered products at <a href={ link } target={ target } >Innovation Makers</a>",
        "resumeButton": "Resume",
        "contactMeButton": "Contact Me"
    },
    "projectBase": {
        "title": "Projects"
    },
    "project1": {
        "name": "BAIDirecto - Internet Banking:",
        "description": "I was tasked with optimizing the existing app for improved scalability and performance. My contributions included utilizing my expertise in front-end development, including Vue.js, to improve the platform's responsiveness, speed, and overall user experience. Through careful analysis and optimization of the codebase, I was able to enhance the platform's functionality, such as account balances, transactions, and payment services, while ensuring the platform was accessible to all users.",
        "pills": {
            "roleLabel": "Role",
            "roleDescription": "Frontend developer",
            "companyLabel": "Company",
            "companyDescription": "Innovation Makers",
            "technologiesLabel": "Technologies",
            "technologiesDescription": "HTML \n CSS3 \n JavaScript (ES6) \n Vue.js"
        }
    }
}